# 18~20년 데이터와 21년 데이터 병합하고
# 지역별로 18, 19, 20, 21년 dataframe 추출 및 저장.

# 사용 패키지
import pandas as pd

# 사용 변수
csvs = ['2018~2020_강원도_보행자사고.csv',
'2018~2020_경기도_보행자사고.csv',
'2018~2020_경상남도_보행자사고.csv',
'2018~2020_경상북도_보행자사고.csv',
'2018~2020_광주광역시_보행자사고.csv',
'2018~2020_대구광역시_보행자사고.csv',
'2018~2020_대전광역시_보행자사고.csv',
'2018~2020_부산광역시_보행자사고.csv',
'2018~2020_서울특별시_보행자사고.csv',
'2018~2020_세종특별자치시_보행자사고.csv',
'2018~2020_울산광역시_보행자사고.csv',
'2018~2020_인천광역시_보행자사고.csv',
'2018~2020_전라남도_보행자사고.csv',
'2018~2020_전라북도_보행자사고.csv',
'2018~2020_제주도_보행자사고.csv',
'2018~2020_충청남도_보행자사고.csv',
'2018~2020_충청북도_보행자사고.csv',
'2021_강원도_보행자사고.csv',
'2021_경기도_보행자사고.csv',
'2021_경상남도_보행자사고.csv',
'2021_경상북도_보행자사고.csv',
'2021_광주광역시_보행자사고.csv',
'2021_대구광역시_보행자사고.csv',
'2021_대전광역시_보행자사고.csv',
'2021_부산광역시_보행자사고.csv',
'2021_서울특별시_보행자사고.csv',
'2021_세종특별자치시_보행자사고.csv',
'2021_울산광역시_보행자사고.csv',
'2021_인천광역시_보행자사고.csv',
'2021_전라남도_보행자사고.csv',
'2021_전라북도_보행자사고.csv',
'2021_제주도_보행자사고.csv',
'2021_충청남도_보행자사고.csv',
'2021_충청북도_보행자사고.csv']

uniqueRegion = ['강원도',
'경기도',
'경상남도',
'경상북도',
'광주광역시',
'대구광역시',
'대전광역시',
'부산광역시',
'서울특별시',
'세종특별자치시',
'울산광역시',
'인천광역시',
'전라남도',
'전라북도',
'제주도',
'충청남도',
'충청북도']


# 18~20년 데이터 21년데이 병합 후 따로 연도별로 나눔
for reg in uniqueRegion:
    twoyears=[]
    for file in csvs:
        if reg in file:
            aa = pd.read_csv(f'../데이터/교통사고정보_보행자사고/{file}')
            twoyears.append(aa)
    df1821 = pd.concat(twoyears)
    df18 = df1821[(df1821['사고일시'] >= '2018-01-01') & (df1821['사고일시'] < '2019-01-01')]
    df19 = df1821[(df1821['사고일시'] >= '2019-01-01') & (df1821['사고일시'] < '2020-01-01')]
    df20 = df1821[(df1821['사고일시'] >= '2020-01-01') & (df1821['사고일시'] < '2021-01-01')]
    df21 = df1821[(df1821['사고일시'] >= '2021-01-01') & (df1821['사고일시'] < '2022-01-01')]

    # 지역별 연도별 데이터 따로 저장함
#     df1821.to_csv(f'../데이터/교통사고정보_보행자사고/연별/{reg}_all.csv')  
#     df18.to_csv(f'../데이터/교통사고정보_보행자사고/연별/{reg}_18.csv')   
#     df19.to_csv(f'../데이터/교통사고정보_보행자사고/연별/{reg}_19.csv')  
#     df20.to_csv(f'../데이터/교통사고정보_보행자사고/연별/{reg}_20.csv')  
#     df21.to_csv(f'../데이터/교통사고정보_보행자사고/연별/{reg}_21.csv')  

# 저장된 지역별 연도별 데이터 불러오는 함수
def get_yearly_df(reg):
    df1821 = pd.read_csv(f'../데이터/교통사고정보_보행자사고/연별/{reg}_all.csv')
    df18 = df1821[(df1821['사고일시'] >= '2018-01-01') & (df1821['사고일시'] < '2019-01-01')]
    df19 = df1821[(df1821['사고일시'] >= '2019-01-01') & (df1821['사고일시'] < '2020-01-01')]
    df20 = df1821[(df1821['사고일시'] >= '2020-01-01') & (df1821['사고일시'] < '2021-01-01')]
    df21 = df1821[(df1821['사고일시'] >= '2021-01-01') & (df1821['사고일시'] < '2022-01-01')]
    return df1821, df18, df19, df20, df21

# 예) 대구광역시 데이터 가져오기
# df1821, df18, df19, df20, df21 = get_yearly_df('대구광역시')

